/*
 * 4. Представте, що є сховище дорогих речей, але воно закрите за великими
   залізними воротами. Щоб їх відкрити, треба ввести 4 числа. Ви знаєте, що
   це числа 111, 89, 12, 2.

   Діло в тому, що комп'ютер, який відкриває ворота, приймає лише одне число.
   Але ви знаєте, що це число має тип uint, тобто 32 біти. Також ви знаєте,
   що біти числа 10 мають бути записані в 8 лівих бітах числа, яке відкриває ворота.
   Біти числа 7 мають бути записані в наступні 8 бітів. І так з усіма числами.

   Іншими словами ви маєте написати програму, яка буде містити наступний код:
   byte num1 = 111, num2 = 89, num3 = 12, num4 = 2;
   uint key = 0;

   А потім ви маєте в змінну "key" вписати значення всіх цих змінних.
   Ось так це виглядатиме в бітовому представленні:

      01101111   01011001   00001100   00000010
key = 00000000   00000000   00000000   00000000 (32 біта)
      ^      ^   ^      ^   ^      ^   ^      ^
      |      |   |      |   |      |   |      |
      сюди має   сюди має   сюди має   сюди має
      бути       бути       бути       бути
      записано   записано   записано   записано
      111        89         12         2

   Вам треба завдяки бітовим операторам записати всі ці 4 числа в змінну
   і вивести її на екран. Якщо ви все правильно зробили, то у вас має вийти число
   1,868,106,754.

 */
class Program
{
    static void Main()
    {
        byte num1 = 111, num2 = 89, num3 = 12, num4 = 2;
        uint key = 0;

        key = (uint)(key | (num1 << 24));
        key = (uint)(key | (num2 << 16));
        key = (uint)(key | (num3 << 8));
        key = key | num4;

        System.Console.WriteLine(key);
    }
}