class Program
{
    static void Main()
    {
        System.Console.OutputEncoding = System.Text.Encoding.UTF8;

        System.Console.WriteLine("| Код Сотрудника | Фамилия | Имя | Отчество | Должность | Оклад |");
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            1, "Алексеев", "Иван", "Иванович", "инженер", 4400.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            2, "Алехин", "Игорь", "Иванович", "инженер", 8800.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            9, "Булкин", "Алексей", "Игоревич", "инженер", 3000.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            4, "Золотова", "Инна", "Андреевна", "инженер", 3600.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            5, "Иванов", "Иван", "Иванович", "бухгалтер", 4400.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            6, "Петров", "Петр", "Петрович", "бухгалтер", 11000.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            15, "Пирогов", "Александр", "Алексеевич", "инженер", 7000.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            7, "Сафронов", "Игорь", "Трофимович", "инженер", 3600.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            8, "Сидоров", "Иван", "Олегович", "менеджер", 5500.00);
        System.Console.WriteLine("| {0,14} | {1,14} | {2,14} | {3,14} | {4,14} | {5,14:C} |",
            10, "Хлебов", "Олег", "Олегович", "инженер", 4400.00);
    }
}