class Program
{
    static void Main()
    {
        System.Console.OutputEncoding = System.Text.Encoding.UTF8;

        System.Console.WriteLine($"+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++");
        System.Console.WriteLine($"| Код Сотрудника | Фамилия        | Имя            | Отчество       | Должность      | Оклад          |");
        System.Console.WriteLine($"+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++");
        System.Console.WriteLine($"| {1,14} | {"Алексеев",14} | {"Иван",14} | {"Иванович",14} | {"инженер",14} | {4400.00,14:C} |");
        System.Console.WriteLine($"| {2,14} | {"Алехин",14} | {"Игорь",14} | {"Иванович",14} | {"инженер",14} | {8800.00,14:C} |");
        System.Console.WriteLine($"| {9,14} | {"Булкин",14} | {"Алексей",14} | {"Игоревич",14} | {"инженер",14} | {3000.00,14:C} |");
        System.Console.WriteLine($"| {4,14} | {"Золотова",14} | {"Инна",14} | {"Андреевна",14} | {"инженер",14} | {3600.00,14:C} | ");
        System.Console.WriteLine($"| {5,14} | {"Иванов",14} | {"Иван",14} | {"Иванович",14} | {"бухгалтер",14} | {4400.00,14:C} | ");
        System.Console.WriteLine($"| {6,14} | {"Петров",14} | {"Петр",14} | {"Петрович",14} | {"бухгалтер",14} | {11000.00,14:C} |");
        System.Console.WriteLine($"| {15,14} | {"Пирогов",14} | {"Александр",14} | {"Алексеевич",14} | {"инженер",14} | {7000.00,14:C} |");
        System.Console.WriteLine($"| {7,14} | {"Сафронов",14} | {"Игорь",14} | {"Трофимович",14} | {"инженер",14} | {3600.00,14:C} |");
        System.Console.WriteLine($"| {8,14} | {"Сидоров",14} | {"Иван",14} | {"Олегович",14} | {"менеджер",14} | {5500.00,14:C} |");
        System.Console.WriteLine($"| {10,14} | {"Хлебов",14} | {"Иван",14} | {"Олегович",14} | {"инженер",14} | {4400.00,14:C} |");
        System.Console.WriteLine($"+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++");
    }
}